chenlongchoo/EM6300/Microchip/mTouchCap/PIC18F_PIC24F CTMU Library/mTouchCap_PIC24_CTMU_Physical.c
		Set_ScanTimer_IF_Bit_State(DISABLE);              //Clear timer 4 SHORT flag
		Set_ScanTimer_IE_Bit_State(DISABLE);              //Disable interrupt
		Set_ScanTimer_ON_Bit_State(DISABLE);              //Stop timer 4


		startupCount--;									  // Decrement 'n' times to establish startup


		for(Index=0; Index<ScanChannelIndex; Index++)	
    	{
			averageData[ScanChannels[Index]] = curRawData[ScanChannels[Index]];	// During start up time, set Average each pass.
		}

		 
		Set_ScanTimer_IF_Bit_State(DISABLE);              //Clear flag
		Set_ScanTimer_IE_Bit_State(ENABLE);              //Enable interrupt
    	Set_ScanTimer_ON_Bit_State(ENABLE);              //Run timer
	}
}


/********************************************************************
 * Function		:   void mTouchCapPhy_CTMUSetup(void)
 *
 * PreCondition	:    None
 *
 * Input			:    None
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview		    : 	This function will setup the CTMU control registers.
 *
 *
 * Note				: Does the necessary CTMU setup. 
 *******************************************************************/

void mTouchCapPhy_CTMUSetup(void)
{


	Set_CTMU_ENABLE_Status(DISABLE);		//make sure CTMU is disabled 
	Idle_Mode_CTMU_Operation(DISABLE);		//CTMU continues to run in idle mode
	Set_CTMU_Time_Generation(DISABLE);		//disable edge delay generation mode of the CTMU
	Block_CTMU_Edge(DISABLE);			    //edges are blocked
	Set_Edge_Sequence(DISABLE);		        //edge sequence not needed
	Disble_CTMU_CurrentDischarge;		    //Do not ground the current source
	Set_CTMU_Trigger_Control(DISABLE);		//Trigger Output is disabled
	Enble_CTMU_Negative_Edge2_Polarity;
	CTMU_Edge2_Source_Select(TRIGGER_SOURCE_EXTERNAL1);
	Enble_CTMU_Negative_Edge1_Polarity;
	CTMU_Edge1_Source_Select(TRIGGER_SOURCE_EXTERNAL1);
	

/***************************************************************************
--------------- Demo of API "mTouchCapAPI_CTMU_SetupCurrentSource" -----------------------		
		Setup the current source using the API "mTouchCapAPI_SetUpCTMU_Default". Pass the current source 
		range and Trim value as parameters.
***************************************************************************/
	mTouchCapAPI_CTMU_SetupCurrentSource(CURRENT_RANGE_100XBASE_CURRENT,0x00);

}

 /*********   	End of Function 	*********************/


/********************************************************************
 * Function			:    void mTouchCapPhy_ChannelSetup(WORD ChannelNum)
 *
 * PreCondition		:    None
 *
 * Input			:    ChannelNum
  							CHANNEL_AN0 ,
							CHANNEL_AN1 ,
							CHANNEL_AN2 ,
							CHANNEL_AN3 ,
							CHANNEL_AN4 ,
							CHANNEL_AN5 ,
							CHANNEL_AN6 ,
							CHANNEL_AN7 ,
							CHANNEL_AN8 ,
							CHANNEL_AN9 ,
							CHANNEL_AN10 ,
							CHANNEL_AN11 ,
							CHANNEL_AN12 ,
							CHANNEL_AN13 ,	
							CHANNEL_AN14 ,	
							CHANNEL_AN15 ,
							CHANNEL_AN16 ,
							CHANNEL_AN17 ,
							CHANNEL_AN18 ,
							CHANNEL_AN19 ,	
							CHANNEL_AN20 ,	
							CHANNEL_AN21 ,	
							CHANNEL_AN22 ,	
							CHANNEL_AN23,
							//Check the availability of channels in the PIC MCU being used
 *
 * Output			:   None
 *
 * Side Effects		:   None
 *
 *
 * Overview			: 	This function will setup the ADC channels that are used by the CTMU
 *				   		Eval Board.
 *
 * Note				:	Does the necessary CTMU port setup.
 *******************************************************************/
void mTouchCapPhy_ChannelSetup(WORD ChannelNum)	 
{
		#ifdef ADC_LEGACY
		#ifdef PIC24F_LOW_PIN_DEVICE
		Adc_Port_Configuration(MAKE_ALL_PINS_DIGITAL)	// Configure all pin as Digital I/O for Low pin devices
		#else 
		Adc_Port_Configuration(MAKE_ALL_PINS_DIGITAL);	// Configure all pin as Digital I/O
		Adc_Port_Hgh_Configuration(MAKE_ALL_PINS_DIGITAL); // Configure all pin as Digital I/O 
        #endif
		#endif
		
		#ifdef ADC_NEW
		
		#if defined(__PIC24FJ128DA106__) ||  defined(__PIC24FJ128DA206__) || defined(__PIC24FJ256DA106__)\
   		 || defined(__PIC24FJ256DA206__) ||  defined(__PIC24FJ128GB206__) || defined(__PIC24FJ256GB206__)
		Adc_PortB_Configuration(MAKE_ALL_PINS_DIGITAL);	// Configure all pin as Digital I/O
		#elif defined  PIC24F_LOW_PIN_DEVICE
		Adc_PortA_Configuration(MAKE_ALL_PINS_DIGITAL);	// Configure all pin as Digital I/O
		Adc_PortB_Configuration(MAKE_ALL_PINS_DIGITAL);	
		#else 
		#ifndef USE_MTOUCH_AND_GRAPHICS
		Adc_PortA_Configuration(MAKE_ALL_PINS_DIGITAL);	// Configure all pin as Digital I/O
		Adc_PortC_Configuration(MAKE_ALL_PINS_DIGITAL);		
		#endif
		Adc_PortB_Configuration(MAKE_ALL_PINS_DIGITAL);	// Configure all pin as Digital I/O	
		Adc_PortE_Configuration(MAKE_ALL_PINS_DIGITAL);			
		Adc_PortG_Configuration(MAKE_ALL_PINS_DIGITAL);	
		#endif
		#endif
		
//Pins are set as output but all pins need not be output. User can change as per application.

		#ifdef ADC_LEGACY		
		
		TRISB = 0x0000;  
		LATB =  0x0000;
		PORTB = 0x0000;

		#if defined(__PIC24F04KA200__) || defined(__PIC24F04KA201__)||  defined(__PIC24F08KA101__)\
		|| defined(__PIC24F08KA102__)  || defined(__PIC24F16KA101__)  || defined(__PIC24F16KA102__)
		TRISA = 0x0000;  
		LATA =  0x0000;
		PORTA = 0x0000;
		
		TRISB = 0x0000;  
		LATB =  0x0000;
		PORTB = 0x0000;
		#endif
		#endif

		#ifdef ADC_NEW	
		#ifdef USE_MTOUCH_AND_GRAPHICS

//		TRISA = TRISA & !(0x00C0); 			
		TRISB = TRISB & SET_PORT_B_PINS_OUTPUT; 	
//		TRISC = TRISC & !(0x0010); 			
		TRISE = TRISE & SET_PORT_E_PINS_OUTPUT; 			
		TRISG = TRISG & SET_PORT_G_PINS_OUTPUT; 	

//		LATA = LATA & !(0x00C0); 			
//		LATB = LATB & !(0xFFFF); 	
		LATBbits.LATB5 = 0;
//		LATC = LATC & !(0x0010); 			
//		LATE = LATE & !(0x0200); 			
		LATEbits.LATE9 = 0;
//		LATG = LATG & !(0x03C0); 	
		LATGbits.LATG8 = 0;
				
//		PORTA = PORTA & !(0x00C0); 			
//		PORTB = PORTB & !(0xFFFF); 	
//		PORTC = PORTC & !(0x0010); 			
//		PORTE = PORTE & !(0x0200); 			
//		PORTG = PORTG & !(0x03C0); 	
		
		#elif defined(__PIC24F16KA301__)   || defined (__PIC24F16KA302__)  || defined(__PIC24F16KA304__)\
		||  defined(__PIC24F32KA301__)   || defined (__PIC24F32KA302__)  || defined(__PIC24F32KA304__)\
		||  defined(__PIC24FV16KA301__)  || defined (__PIC24FV16KA302__) || defined(__PIC24FV16KA304__)\
		||  defined(__PIC24FV32KA301__)  || defined (__PIC24FV32KA302__) || defined(__PIC24FV32KA304__)
		TRISA = TRISA & !(0x000F); 			
		TRISB = TRISB & !(0xF017); 	
		
		LATA = LATA & !(0x000F); 			
		LATB = LATB & !(0xF017); 	
						
		PORTA = PORTA & !(0x000F); 		
		PORTB = PORTB & !(0xF017);
		
		#elif defined(__PIC24FJ128DA106__) ||  defined(__PIC24FJ128DA206__) || defined(__PIC24FJ256DA106__)\
   		   || defined(__PIC24FJ256DA206__) ||  defined(__PIC24FJ128GB206__) || defined(__PIC24FJ256GB206__)
		 			
		TRISB = TRISB & !(0xFFFF); 	
		TRISC = TRISC & !(0x0010); 			
		TRISE = TRISE & !(0x0200); 			
		TRISG = TRISG & !(0x03C0); 	
			
		LATB = LATB & !(0xFFFF); 	
		LATC = LATC & !(0x0010); 			
		LATE = LATE & !(0x0200); 			
		LATG = LATG & !(0x03C0); 	
							
		PORTB = PORTB & !(0xFFFF); 	
		PORTC = PORTC & !(0x0010); 			
		PORTE = PORTE & !(0x0200); 			
		PORTG = PORTG & !(0x03C0); 	
		
		#else
			
		TRISA = TRISA & !(0x00C0); 			
		TRISB = TRISB & !(0xFFFF); 	
		TRISC = TRISC & !(0x0010); 			
		TRISE = TRISE & !(0x0200); 			
		TRISG = TRISG & !(0x03C0); 	

		LATA = LATA & !(0x00C0); 			
		LATB = LATB & !(0xFFFF); 	
		LATC = LATC & !(0x0010); 			
		LATE = LATE & !(0x0200); 			
		LATG = LATG & !(0x03C0); 	
				
		PORTA = PORTA & !(0x00C0); 			
		PORTB = PORTB & !(0xFFFF); 	
		PORTC = PORTC & !(0x0010); 			
		PORTE = PORTE & !(0x0200); 			
		PORTG = PORTG & !(0x03C0); 	
		
		#endif
		#endif
		Nop();    Nop();    Nop();    Nop();    Nop();    Nop();    Nop();    Nop();


    switch (ChannelNum)
	{

		case CHANNEL_AN0:
            TRIS_CHANNEL_AN0 = INPUT;               //make the channel 0 as input based on the Index
			ADC_CHANNEL_AN0(ANALOG);
                      
        break;

		case CHANNEL_AN1:
            TRIS_CHANNEL_AN1 = INPUT;               //make the channel 1 as input based on the Index
			ADC_CHANNEL_AN1(ANALOG);
		break;

		case CHANNEL_AN2:
            TRIS_CHANNEL_AN2 = INPUT;               //make the channel 2 as input based on the Index
			ADC_CHANNEL_AN2(ANALOG);
 		break;

