chenlongchoo/EM6300/Microchip/mTouchCap/PIC18F_PIC24F CTMU Library/mTouchCap_PIC24_CTMU_Physical.c
		case CHANNEL_AN3:
            TRIS_CHANNEL_AN3 = INPUT;               //make the channel 3 as input based on the Index
			ADC_CHANNEL_AN3(ANALOG);
		break;

		case CHANNEL_AN4:
            TRIS_CHANNEL_AN4 = INPUT;               //make the channel 4 as input based on the Index
			ADC_CHANNEL_AN4(ANALOG);
		break;

		case CHANNEL_AN5:
            TRIS_CHANNEL_AN5 = INPUT;               //make the channel 5 as input based on the Index
			ADC_CHANNEL_AN5(ANALOG);
		break;

		case CHANNEL_AN6:
            TRIS_CHANNEL_AN6 = INPUT;               //make the channel 6 as input based on the Index
			ADC_CHANNEL_AN6(ANALOG);
		break;

		case CHANNEL_AN7:
            TRIS_CHANNEL_AN7 = INPUT;               //make the channel 7 as input based on the Index
			ADC_CHANNEL_AN7(ANALOG);
		break;

		case CHANNEL_AN8:
            TRIS_CHANNEL_AN8 = INPUT;               //make the channel 8 as input based on the Index
			ADC_CHANNEL_AN8(ANALOG);
		break;
		
		#ifndef PIC24F_LOW_PIN_DEVICE
		case CHANNEL_AN9:
            TRIS_CHANNEL_AN9 = INPUT;               //make the channel 9 as input based on the Index
			ADC_CHANNEL_AN9(ANALOG);
		break;

		case CHANNEL_AN10:
            TRIS_CHANNEL_AN1O = INPUT;               //make the channel 10 as input based on the Index
			ADC_CHANNEL_AN10(ANALOG);
		break;

		case CHANNEL_AN11:
            TRIS_CHANNEL_AN11 = INPUT;               //make the channel 11 as input based on the Index
			ADC_CHANNEL_AN11(ANALOG);
 		break;

		case CHANNEL_AN12:
            TRIS_CHANNEL_AN12 = INPUT;               //make the channel 12 as input based on the Index
			ADC_CHANNEL_AN12(ANALOG);
 		break;

		case CHANNEL_AN13:
            TRIS_CHANNEL_AN13= INPUT;               //make the channel 13 as input based on the Index
			ADC_CHANNEL_AN13(ANALOG);
 		break;

		case CHANNEL_AN14:
            TRIS_CHANNEL_AN14 = INPUT;               //make the channel 14 as input based on the Index
			ADC_CHANNEL_AN14(ANALOG);
 		break;
		
		case CHANNEL_AN15:
            TRIS_CHANNEL_AN15= INPUT;               //make the channel 15 as input based on the Index
			ADC_CHANNEL_AN15(ANALOG);
 		break;
		
#if defined(__PIC24FJ_DAXXX__)
		
		case CHANNEL_AN16:
            TRIS_CHANNEL_AN16 = INPUT;               //make the channel 16 as input based on the Index
			ADC_CHANNEL_AN16(ANALOG);
		break;

		case CHANNEL_AN17:
            TRIS_CHANNEL_AN17 = INPUT;               //make the channel 17 as input based on the Index
			ADC_CHANNEL_AN17(ANALOG);
		break;

		case CHANNEL_AN18:
            TRIS_CHANNEL_AN18 = INPUT;               //make the channel 18 as input based on the Index
			ADC_CHANNEL_AN18(ANALOG);
		break;

		case CHANNEL_AN19:
            TRIS_CHANNEL_AN19 = INPUT;               //make the channel 19 as input based on the Index
			ADC_CHANNEL_AN19(ANALOG);
 		break;

		case CHANNEL_AN20:
            TRIS_CHANNEL_AN20 = INPUT;               //make the channel 20 as input based on the Index
			ADC_CHANNEL_AN20(ANALOG);
 		break;

		case CHANNEL_AN21:
            TRIS_CHANNEL_AN21= INPUT;               //make the channel 21 as input based on the Index
			ADC_CHANNEL_AN21(ANALOG);
 		break;

		case CHANNEL_AN22:
            TRIS_CHANNEL_AN22 = INPUT;               //make the channel 22 as input based on the Index
			ADC_CHANNEL_AN22(ANALOG);
 		break;
		
		case CHANNEL_AN23:
            TRIS_CHANNEL_AN23= INPUT;               //make the channel 23 as input based on the Index
			ADC_CHANNEL_AN23(ANALOG);
 		break;		
		
		
#endif		
#endif
		default:
            TRIS_CHANNEL_AN0 = INPUT;               //make the channel 0 as input based on the Index
			ADC_CHANNEL_AN0(ANALOG);
 		break;

	}

	  /* Connect the selected channel to ADC MUX */
         //load the channel number that has to be read
        mTouchCapADC_SetChannelADC(ChannelNum);

}

 /*********   	End of Function 	*********************/

/********************************************************************
 * Function			:    void mTouchCapPhy_AdcSetup(void)
 *
 * PreCondition		:    None
 *
 * Input			:    None
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			:	This function will setup the ADC module
 *
 * Note				: 	Does the necessary ADC peripheral setup.
 *******************************************************************/
void mTouchCapPhy_AdcSetup(void)
{
	mTouchCapADC_SetChannelADC (0x00);
	mTouchCapADC_OpenADC();	
	
}

 /*********   	End of Function 	*********************/
 
/********************************************************************
 * Function			:    void mTouchCapPhy_SetupCurrentSourceRange(WORD CurrentSourceRange);
 *
 * PreCondition		:    None
 *
 * Input			:    Analog Current Source Range
 * 	 					 CURRENT_RANGE_100XBASE_CURRENT //Current source Range is 100*Base current (55uA) 
 *						 CURRENT_RANGE_10XBASE_CURRENT  //Current source Range is 10*Base current (5.5uA)
 *						 CURRENT_RANGE_BASE_CURRENT     //Current source Range is Base current (0.55uA)
 *						 CURRENT_SRC_DISABLED           //Current source disabled
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			: 	 This function will select the required Analog Current Source Range.
 *
  * Note			: 	 Sets up the CTMU current source.
 *******************************************************************/
void mTouchCapPhy_SetupCurrentSourceRange(WORD CurrentSourceRange)
{
	CTMU_Select_Current_Source(CurrentSourceRange);
 }

 /*********   	End of Function 	*********************/

 /********************************************************************
 * Function			:    void	mTouchCapPhy_SetTrimValue( WORD TrimValue);
 * PreCondition		:    None
 *
 * Input			:    TrimValue : CTMU TRIM bits Settings 
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			:	 This function will setup the trim values for the selected current source range
 *
 * Note				: 	 Set the proper Trim  value of the current source as passed in the argument.
 *******************************************************************/

void	mTouchCapPhy_SetTrimValue( WORD TrimValue)
{

