chenlongchoo/EM6300/Microchip/mTouchCap/PIC18F_PIC24F CTMU Library/mTouchCap_PIC24_CTMU_Physical.c
    CTMU_Trim_Value (TrimValue);
	
}

/********************************************************************
 * Function			:    void	mTouchCapPhy_Discharge_Current (void)
 *
 * PreCondition		:    None
 *
 * Input			:    None
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			: 	Discharges the current source.
 *
 *
 * Note				:
 *******************************************************************/

void	mTouchCapPhy_Discharge_Current (void)
{
		Enble_CTMU_CurrentDischarge;
		Nop(); Nop();    Nop();    Nop();    Nop();
		Nop(); Nop();    Nop();    Nop();    Nop();
		Nop();	 // Delay for CTMU charge time
		
		Disble_CTMU_CurrentDischarge;
	
}

 /*********   	End of Function 	*********************/

/********************************************************************
 * Function			:    void	mTouchCapPhy_Charge_Current (void)
 *
 * PreCondition		:    None
 *
 * Input			:    None
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			: 	 Charges the cusrrent for the time as per the value given 
 *						 to "CTMU_CHARGE_TIME_COUNT" in mTouchCap_Config.h file.
 *
 *
 * Note			:
 *******************************************************************/

void	mTouchCapPhy_Charge_Current (void)
{		
		WORD loopIndex;
		
		ADC1_Clear_Intr_Status_Bit;
		Enable_ADC_Sampling;
		Disbl_CTMUEdge2;
		Enble_CTMUEdge1;

		
		#ifndef CLOCK_SWITCH_DURING_SLEEP_ENABLE
			if (0 != loopCount) 
			{		
				/* When we require to enaable EDGE1 or EDGE2, should we pass as a param*/
				for (loopIndex = 0; loopIndex < loopCount; loopIndex++) 
				Nop();	 // Delay for CTMU charge time  // PIC18 - 4 TCY to execute Nop(); //PIC24 - 2 TCY to execute Nop();
			}
		
		//when the primary clock is switched to FRC after device wakes from sleep, 
		//the loopcount used for charging the CTMU current source has to be changed based on FRC selection
		#else
			//If the Low power is enabled
			if(Clock_Switch_Enable_Flag) //if the system clock is switched
			{
				// The below NOP() is the time required to charge the CTMU channels when the system
				//clock is switched from Primary clock to FRC.
				// The number of Nop() can be varied based on the system clock
			   	Nop();

		
			}
			
			else
			{
				//when the flag is disabled, the system clock is switched from FRC clock 
				//to Primary clock settings. hence restore the loop count value for primary clock
				loopCount = CTMU_CHARGE_TIME_COUNT;
				if (0 != loopCount)
				{		
					/* When we require to enable EDGE1 or EDGE2, should we pass as a param*/
					for (loopIndex = 0; loopIndex < loopCount; loopIndex++) 
					{
						Nop();	 // Delay for CTMU charge time  // PIC18 - 4 TCY to execute Nop(); //PIC24 - 2 TCY to execute Nop();
					}
				}//end of if (0 != loopCount) //n:ref	
			}
		
		#endif

   		
		Disbl_CTMUEdge1;
	
}

/*********************************************************************
 * Function			:    WORD mTouchCapPhy_Read_ADC(void)
 *
 * PreCondition		:    None
 *
 * Input			:    None
 *
 * Output			:    Resultant ADC Buffer value
 *
 * Side Effects		:    None
 *
 * Overview			:	Reads the ADC data of CTMU Channel.
 *
 *
 * Note				:
 *******************************************************************/

WORD mTouchCapPhy_Read_ADC(void)
{

	WORD Channel_Data;

	ADC1_Clear_Intr_Status_Bit;
	Disable_ADC_Sampling;	
	while(!ADC1_IF_Bit);             // Wait for the A/D conversion to finish
	
	Channel_Data  = mTouchCapADC_ReadADCBuff(0);// Read the value from the A/D conversion

	Disable_ADC_Sampling;
	ADC1_Clear_Intr_Status_Bit;
	ADC_Done_Bit      = 0; 

	return Channel_Data;
		
	
}

 /*********   	End of Function 	*********************/



/********************************************************************
 * Function			:    void mTouchCapPhy_InitCTMU(void) 
 *
 * PreCondition		:    None
 *
 * Input			:    None
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			: 	 Does the initialization of all peripherals/ports
 *						 necessary for CTMU operation.
 *
 *
 * Note				:
 *******************************************************************/
void mTouchCapPhy_InitCTMU(void) 
{
	/* Initialize PORTs  */
	mTouchCapApp_PortSetup();
	
 	/* Initialize CTMU  */
	mTouchCapPhy_CTMUSetup();

	/* Initialize ADC  */
	mTouchCapPhy_AdcSetup();


	Set_Adc_Enable_State(ENABLE);

	Enable_ADC_Sampling;
	
	Set_CTMU_ENABLE_Status (ENABLE);

	Enble_CTMU_CurrentDischarge;        // Drain any charge on the circuit
	Nop(); Nop();    Nop();    Nop();    Nop();	
	Disble_CTMU_CurrentDischarge;
	Nop(); Nop();    Nop();    Nop();    Nop();						
}

/********************************************************************
 * Function			:    void mTouchCapPhy_ChargeTimeInit(void)
 *
 * PreCondition		:    None
 *
 * Input			:    None
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			: 	Initializes the charge time. User can change this by 
 *						modifying the value given for "CTMU_CHARGE_TIME_COUNT"
 * 						in Config.h file.
 *
 * Note				:
 *******************************************************************/
void mTouchCapPhy_ChargeTimeInit(void)
{
	loopCount 	= CTMU_CHARGE_TIME_COUNT;	//Loop counter - determines charge time for each 									

}


/********************************************************************
 * Function			:    void mTouchCapPhy_ReadCTMU(WORD ChannelNumber) 
 *
 * PreCondition		:    None
 *
 * Input			:    ChannelNumber
  							CHANNEL_AN0 ,
							CHANNEL_AN1 ,
							CHANNEL_AN2 ,
							CHANNEL_AN3 ,
							CHANNEL_AN4 ,
							CHANNEL_AN5 ,
							CHANNEL_AN6 ,
							CHANNEL_AN7 ,
							CHANNEL_AN8 ,
							CHANNEL_AN9 ,
							CHANNEL_AN10 ,
							CHANNEL_AN11 ,
							CHANNEL_AN12 ,
							CHANNEL_AN13 ,	
							CHANNEL_AN14 ,	
							CHANNEL_AN15 ,
							CHANNEL_AN16 ,
							CHANNEL_AN17 ,
							CHANNEL_AN18 ,
							CHANNEL_AN19 ,	
							CHANNEL_AN20 ,	
							CHANNEL_AN21 ,	
							CHANNEL_AN22 ,	
							CHANNEL_AN23,
							//Check the availability of channels in the PIC MCU being used	
							
							
