chenlongchoo/EM6300/Microchip/mTouchCap/PIC18F_PIC24F CTMU Library/mTouchCap_PIC24_CTMU_Physical.c
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			: 	 Scans the CTMU channel for ADC voltage. It updates the
 * 						"curRawData" and "actualValue" buffers.
 *
 *
 * Note			:
 *******************************************************************/		
void mTouchCapPhy_ReadCTMU(WORD ChannelNumber) 
{



#ifdef DETAILED_CALCULATION
	DWORD total = 0;
	SHORT chrd;
	// Get the raw sensor reading.
	for(chrd=0; chrd< NUM_HF_READS; chrd++)
	{
		
	/***************************************************************************
	--------------- Demo of API "mTouchCapAPI_CTMU_GetChannelReading" -----------------------		
		Get the channdel ADC data using the API "mTouchCapAPI_CTMU_GetChannelReading". 
	***************************************************************************/
		currentADCValue = mTouchCapAPI_CTMU_GetChannelReading(ChannelNumber);
		//End of CTMU read
		total = total + currentADCValue;
	}

	
	#ifdef GROUND_TEST					// Note: A/D conversion not used 
		/* CHANGE_MCHP */				// A/D mux must connect to channel for CTMU to drain charge
		mTouchCapPhy_Discharge_Current ();
	#endif

	/* Error check */
	if (total != 0) 
	{
		currentADCValue = total/NUM_HF_READS;
	}
	else
	{
		currentADCValue = 0;
	}
	
#else /* One shot calculation using Iterative method */
		/***************************************************************************
		--------------- Demo of API "mTouchCapAPI_ScanChannelIterative" -----------------------
		
		Read the channel Rawdata in an iterative fashion for the mentioned sample count using the 
		API "mTouchCapAPI_ScanChannelIterative". 
	***************************************************************************/
	
	#ifndef CLOCK_SWITCH_DURING_SLEEP_ENABLE
		currentADCValue = mTouchCapAPI_ScanChannelIterative(ChannelNumber,NUM_HF_READS);

	#else
		//if the Low power demo is enabled
		if(Clock_Switch_Enable_Flag)	//If the system clock is switched to FRC
		{
			//The sample count is reduced since the system clock is switched from
			//Primary to FRC
			currentADCValue = mTouchCapAPI_ScanChannelIterative(ChannelNumber,NUM_HF_READS_SWITCHED_CLOCK);
		}		
		else
		{
			//if the system clock is the Primary Clock
			currentADCValue = mTouchCapAPI_ScanChannelIterative(ChannelNumber,NUM_HF_READS);
		}	
	

	#endif
	


#endif

	//For debug - channels 6&7 are not enabled. They are clk & data lines for ICSP. use dummy values
	#ifdef DEBUG
	if(ScanChannels[ChannelNumber] == CHANNEL_AN6 || ScanChannels[ChannelNumber]  == CHANNEL_AN7)
	{
		currentADCValue = 0x240;
	}
	// ...
	#endif

#ifdef GUI_USB_INTERFACE 
	scaledBigValue   = currentADCValue  * 64; 	// BIGVAL is current measurement left shifted 4 bits for GUI display
#else
	scaledBigValue   =  currentADCValue;		// Copy the ADC value of the channel
#endif

	curRawData[ChannelNumber] = scaledBigValue;	// curRawData array holds the most recent BIGVAL values
	actualValue[ChannelNumber] = currentADCValue;

	
} //end ReadCTMU()




/******************************************************************************
 * Function			:    void CTMU_Current_trim_config(int channel_no)
 *
 * PreCondition		:    None
 *
 * Input			:    current Channel number that is being processed by ADC
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			:    This function will set the trim bits for 2 channel slider
 *						 4 channel slider, Direct key and MAtrix key board
 *
 * Note			    :    None
 *****************************************************************************/
void CTMU_Current_trim_config(int channel_no)
{

	//BYTE ChannelIndex;
	
	//The current range and the trim bits will be changed based on the frequency of the system clock
	#ifndef CLOCK_SWITCH_DURING_SLEEP_ENABLE	
	if(trimbitsReady)
	{
		mTouchCapAPI_CTMU_SetupCurrentSource(channel_IRNG_value[channel_no],channel_TRIM_value[channel_no]);
	}
	#else			
		//if the Low power demo is enabled
		if(Clock_Switch_Enable_Flag)	//If the system clock is switched to FRC
		{
//			//After the clock is switched from Primary to FRC, the current range and trim bits should also be
//			//changed to work with the lower clock.
		
			mTouchCapAPI_CTMU_SetupCurrentSource(CURRENT_RANGE_100XBASE_CURRENT,channel_TRIM_value[channel_no]);

		}
		else
		{
			if(trimbitsReady)
			{
				mTouchCapAPI_CTMU_SetupCurrentSource(channel_IRNG_value[channel_no],channel_TRIM_value[channel_no]);
			}
		} //end of if(Clock_Switch_Enable_Flag)
	#endif //end of CLOCK_SWITCH_DURING_SLEEP_ENABLE
}  

/********************************************************************
 * Function			:    void mTouchCapPhy_AverageData(WORD Index)
 *
 * PreCondition		:    None
 *
 * Input			:    Channel Number 
 *
 * Output			:    None
 *
 * Side Effects		:    None
 *
 * Overview			:	This function is used to average the Current Raw ADC value and the 
 *						Average ADC value based on the type of the decode method that is 
 *						selected by the application.
 * Note				:
 *******************************************************************/
 
void mTouchCapPhy_AverageData(WORD Index)
{

     BYTE Filter_type; 
	

	 /* Filtering based on channel specefic filter type */
	Filter_type = chFilterType[Index];

	/* Check the opted filter type of the channel. Copy if within limits. Else, the default type would be "1BY20" method. */
	if ( (Filter_type > FILTER_METHOD_FASTAVERAGE) )
	{
   		 Filter_type = FILTER_METHOD_SLOWAVERAGE; 
	}

	/* Process the average based on filter type selected by user in APi-mTouchCapAPI_SetUpChannel*/
	switch(Filter_type)
	{
	   case FILTER_METHOD_SLOWAVERAGE:
			// 7. Average in the new value (channel based delay)
					// Always Average (all buttons one after the other in a loop)

			//When Low Power Demo is selected
			#ifdef LOW_POWER_DEMO_ENABLE
			//Default_RawData_with_FRC_Flag --> flag set after FRC clock is selected
			// When the System clock is switched from the Primary to the FRC, the averageData[Index] should
			// be updated with the latest raw values which is calculated using the FRC
			//This is required because the curRawData[Index] value calculated using the Primary clock and the
			// FRC clock will be different.
				if(Default_RawData_with_FRC_Flag)
				{

					// Debounce logic
					if(Counter[Index] <DEBOUNCECOUNT_FRC)
					{
						Counter[Index] ++;
						averageData[Index] = curRawData[Index];
					}
					else
					{
						// If the debounce logic is applied for all the keys, then the subsequent raw values 
						//can be considered as stable.
						Counter[Index]  = 0;
						if(Index >= (ScanChannels[ScanChannelIndex-1]))
						{				
							Default_RawData_with_FRC_Flag = 0;
						
