chenlongchoo/EM6300/Microchip/mTouchCap/PIC18F_PIC24F CTMU Library/mTouchCap_PIC24_CTMU_Physical.c
						}
					} //end of if(Counter[Index] <4)
				}//end of 	if(Default_RawData_with_FRC_Flag)

				
			#endif	//end of #ifdef LOW_POWER_DEMO_ENABLE
			
			if (curRawData[Index]  > averageData[Index])
			{
				averageData[Index] = curRawData[Index];				// If curRawData is above Average, reset to high average.
			}
	
			if(avg_delay[Index] < NUM_AVG)
			{
				avg_delay[Index]++;						// Counting 0..8 has effect of every 9th count cycling the next button.
			}
			else
			{
				avg_delay[Index] = 0;					// Counting 0..4 will average faster and also can use 0..4*m, m=0,1,2,3..
			}
			
			if(avg_delay[Index] == NUM_AVG)
			{
					smallAvg[Index] = averageData[Index] / NUM_AVG; 	// SMALLAVG is the current average right shifted 4 bits
					// Average in raw value.
					averageData[Index] = averageData[Index] + ((curRawData[Index] / NUM_AVG) - smallAvg[Index]);
			}
				
	  break;


	  case FILTER_METHOD_GATEDAVERAGE:
			//Filter Method CASE: Gated Average

			/* The latest current raw data would be the latest average data */
			//When Low Power Demo is selected
			#ifdef LOW_POWER_DEMO_ENABLE
			//Default_RawData_with_FRC_Flag --> flag set after FRC clock is selected
				if(Default_RawData_with_FRC_Flag)
				{
					//Counter[Index] ++;
					//averageData[Index] = curRawData[Index];
					if(Counter[Index] <DEBOUNCECOUNT_FRC)
					{
						Counter[Index] ++;
						averageData[Index] = curRawData[Index];
					}
					else
					{
						Counter[Index]  = 0;
						if(Index >= (ScanChannels[ScanChannelIndex-1]))
						{				
							Default_RawData_with_FRC_Flag = 0;
						
						}
					} //end of if(Counter[Index] <4)
				}//end of 	if(Default_RawData_with_FRC_Flag)
			#endif	//end of #ifdef LOW_POWER_DEMO_ENABLE
			//  Average in the new value (channel based delay)
			// Always Average (all buttons one after the other in a loop)
	
			if(avg_delay[Index] < NUM_AVG)
			{
				avg_delay[Index]++;						// Counting 0..8 has effect of every 9th count cycling the next button.
			}
			else
			{
				avg_delay[Index] = 0;					// Counting 0..4 will average faster and also can use 0..4*m, m=0,1,2,3..
			}
			if(avg_delay[Index] == NUM_AVG)
			{
				/* Gated average only of no key pressed. */
				/* Stop averaging when press is being sensed. //STD:*/
				if ( KEY_NOT_PRESSED == mTouchCapAPI_getChannelTouchStatus(Index,DECODE_METHOD_PRESS_ASSERT ))
				{
					smallAvg[Index] = averageData[Index] / NUM_AVG; 	// SMALLAVG is the current average right shifted 4 bits
					// Average in raw value.
					averageData[Index] = averageData[Index] + ((curRawData[Index] / NUM_AVG) - smallAvg[Index]);
				}
			}
     break;

	case FILTER_METHOD_FASTAVERAGE:
			/* The latest current raw data would be the latest average data */
					//When Low Power Demo is selected
			#ifdef LOW_POWER_DEMO_ENABLE
			//Default_RawData_with_FRC_Flag --> flag set after FRC clock is selected
				if(Default_RawData_with_FRC_Flag)
				{
					//Counter[Index] ++;
					//averageData[Index] = curRawData[Index];
					if(Counter[Index] <DEBOUNCECOUNT_FRC)
					{
						Counter[Index] ++;
						averageData[Index] = curRawData[Index];
					}
					else
					{
						Counter[Index]  = 0;
						if(Index >= (ScanChannels[ScanChannelIndex-1]))
						{				
							Default_RawData_with_FRC_Flag = 0;
						
						}
					} //end of if(Counter[Index] <4)
				}//end of 	if(Default_RawData_with_FRC_Flag)
			#endif	//end of #ifdef LOW_POWER_DEMO_ENABLE
		if (curRawData[Index]  > averageData[Index])
		{
			averageData[Index] = curRawData[Index];				// If curRawData is above Average, reset to high average.
		}

	break;

  }

	/* Dynamic trip value calculation . STD: */
	DynamicTripValueCalculation(Index);

}



/********************************************************************
 * Function		:    void DynamicTripValueCalculation(WORD Index)
 *
 * PreCondition	:    None
 *
 * Input		:    Index- Channel Number
 *
 * Output		:    None
 *
 * Side Effects	:    None
 *
 * Overview		: 	 calculate the dynamic trip value.
 *
 *
 * Note			: 
 *******************************************************************/
void DynamicTripValueCalculation(WORD Index)
{
    #ifndef USE_STATIC_TRIP_VALUE

    	#ifndef LOW_POWER_DEMO_ENABLE
			tripValue[Index] = (averageData[Index] / KEYTRIPDIV);
		 hystValue[Index] = (tripValue[Index] / HYSTERESIS_VALUE);
	
		#else
			//If the low power demo is selected, then the keytrip value will be different 
			//because of the switching of the clocks	
			if(Clock_Switch_Enable_Flag)
			{
				//if the clock is switched from Primary to FRC, then change the trip value to suit 
				//the lower clock frequency
				tripValue[Index] = (averageData[Index] / KEYTRIPDIV_FRC);
				 hystValue[Index] = (tripValue[Index] / HYSTERESIS_VALUE_FRC);
			}
			else
			{
				// If the Primary clock is selected, restore the Trip value.
   				tripValue[Index] = (averageData[Index] / KEYTRIPDIV);
				hystValue[Index] = (tripValue[Index] / HYSTERESIS_VALUE);

			}
				
		#endif
   
    
    #endif
}


